roll1D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  GAMG;
        tolerance               1e-8;
        relTol                  1e-1;
        smoother                GaussSeidel;
        agglomerator            faceAreaPair;
        nCellsInCoarsestLevel   10;
        mergeLevels             1;
        cacheAgglomeration      true;
        minIter                 1;
    }

    U
    {
        type                    coupled;
        solver                  PBiCCCG;
        preconditioner          DILU;
        tolerance               (1e-8 1e-8 1e-8);
        relTol                  (1e-1 1e-1 1e-1);
    }

    "C0|C1"
    {
        solver                  GAMG;
        tolerance               1e-8;
        relTol                  1e-1;
        smoother                GaussSeidel;
        agglomerator            faceAreaPair;
        nCellsInCoarsestLevel   10;
        mergeLevels             1;
        cacheAgglomeration      true;
        minIter                 1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               1e-6;
        U               1e-6;
    } 
}

relaxationFactors
{
    fields
    {
        p               0.05;
    }
    equations
    {
        U               0.95;
    }
}
          
concentration
{
    nCycle              100;
    tolerance           1e-6;
}

// ************************************************************************* //
